app/controllers/home_controller.rb

    def index
        if session[:user]
            @name = session[:user]["name"]
            @profile_picture_url = session[:user]["image_url"]
            user_id = session[:user]["id"]
            user_games = Game.where(user_id: user_id)
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 12]]