app/controllers/scoreboard_controller.rb

  def index
    if session[:user]
      @users = User.all
---
SELECT "users".* FROM "users"